%第９章_程式流程控制
%關係運算子
clear;clc
4<12                        %回應1代表true(結果成立)
                            %回應0代表false

x=3;
y=5;
fprintf('x>y is %d \n',x>y) %回應1代表true(結果成立)
                            %回應0代表false(結果不成立)
fprintf('%d = %d is %d \n',x,y,x==y) %回應1代表true(結果成立)
                                     %回應0代表false(結果不成立)
b=[3 5 8] > [9 4 2]         %個別運算每個元素，結果為陣列
logical([1 2 3 0 5 7 0 9])  %只要不是0的數字，logical()會把它看成是true
                            %因此轉換為1
                            %是0的數字，結果為0
a1=[1 4 3 0 5 -9];
logical(a1)                 %只要不是0的數字，logical()會把它看成是true
                            %因此轉換為1
                            %是0的數字，結果為0
ind=a1(a1>0)                %把大於0的資料叫出
ind2=find(a1>0)             %把滿足條件的位置叫出
logical(a1>0)               %大於0的數都看成是true
logical(a1>0)=-9            %大於0的元素都設值為-9
a1(ind2)                    %寫出該位置的值 
a2=[1 4 2;3 9 6;8 4 7]
b=a2>5
a2(b)