%假設此軍艦發射三枚海對空飛彈攻擊來襲的反艦飛彈，
%而每一枚海對空飛彈每次攻擊的成功機率分別是 0.3、0.5、0.7及 0.9，
%則在軍艦被擊中前，
%計算成功摧毀來襲飛彈的機率(包含 1 枚、2 枚、及 3 枚成功摧毀來襲飛彈)。
clear;clc
p1=0.3; %第1種飛彈
pk11=ML_00781035_func_ex08(0.3,1,3); % 1 枚成功摧毀來襲飛彈
fprintf('第1種飛彈每次成功機率 : %g \n成功摧毀 1 枚來襲飛彈的機率 : %g \n\n'...
    ,p1,pk11)
pk12=ML_00781035_func_ex08(0.3,2,3); % 2 枚成功摧毀來襲飛彈
fprintf('第1種飛彈每次成功機率 : %g \n成功摧毀 2 枚來襲飛彈的機率 : %g \n\n'...
    ,p1,pk12)
pk13=ML_00781035_func_ex08(0.3,3,3); % 3 枚成功摧毀來襲飛彈
fprintf('第1種飛彈每次成功機率 : %g \n成功摧毀 3 枚來襲飛彈的機率 : %g \n\n'...
    ,p1,pk13)

p2=0.5; %第2種飛彈
pk21=ML_00781035_func_ex08(0.5,1,3); % 1 枚成功摧毀來襲飛彈
fprintf('第2種飛彈每次成功機率 : %g \n成功摧毀 1 枚來襲飛彈的機率 : %g \n\n'...
    ,p2,pk21)
pk22=ML_00781035_func_ex08(0.5,2,3); % 2 枚成功摧毀來襲飛彈
fprintf('第2種飛彈每次成功機率 : %g \n成功摧毀 2 枚來襲飛彈的機率 : %g \n\n'...
    ,p2,pk22)
pk23=ML_00781035_func_ex08(0.5,3,3); % 3 枚成功摧毀來襲飛彈
fprintf('第2種飛彈每次成功機率 : %g \n成功摧毀 3 枚來襲飛彈的機率 : %g \n\n'...
    ,p2,pk23)

p3=0.7; %第3種飛彈
pk31=ML_00781035_func_ex08(0.7,1,3); % 1 枚成功摧毀來襲飛彈
fprintf('第3種飛彈每次成功機率 : %g \n成功摧毀 1 枚來襲飛彈的機率 : %g \n\n'...
    ,p3,pk31)
pk32=ML_00781035_func_ex08(0.7,2,3); % 2 枚成功摧毀來襲飛彈
fprintf('第3種飛彈每次成功機率 : %g \n成功摧毀 2 枚來襲飛彈的機率 : %g \n\n'...
    ,p3,pk32)
pk33=ML_00781035_func_ex08(0.7,3,3); % 3 枚成功摧毀來襲飛彈
fprintf('第3種飛彈每次成功機率 : %g \n成功摧毀 3 枚來襲飛彈的機率 : %g \n\n'...
    ,p3,pk33)

p4=0.9; %第4種飛彈
pk41=ML_00781035_func_ex08(0.9,1,3); % 1 枚成功摧毀來襲飛彈
fprintf('第4種飛彈每次成功機率 : %g \n成功摧毀 1 枚來襲飛彈的機率 : %g \n\n'...
    ,p4,pk41)
pk42=ML_00781035_func_ex08(0.9,2,3); % 2 枚成功摧毀來襲飛彈
fprintf('第4種飛彈每次成功機率 : %g \n成功摧毀 2 枚來襲飛彈的機率 : %g \n\n'...
    ,p4,pk42)
pk43=ML_00781035_func_ex08(0.9,3,3); % 3 枚成功摧毀來襲飛彈
fprintf('第4種飛彈每次成功機率 : %g \n成功摧毀 3 枚來襲飛彈的機率 : %g \n\n'...
    ,p4,pk43)