%曾鈺皓_0071035_Matlab簡介_作業5
clear;clc;clf;
%(A)以 randi 函數產生 100 個雨滴粒半徑(r),其值在 1~100(微米)區間,
%並以 fprintf()指令分別顯示雨滴粒半徑、雨滴終端速度、及雨滴體積的最小值和最大值
a=randi([1,100],[1,100]); %1到100「微米」
vt1=(9.8*(a*10^-6).^2*(997-1.204))/18/(1.81*10^-5); %終端速度
v=4*pi*((a*10^-6).^3)/3;  %體積
fprintf('雨滴半徑最小值:%g \n雨滴半徑最大值:%g \n',min(a),max(a))
fprintf('雨滴終端速度最小值:%g \n雨滴終端速度最大值:%g \n',min(vt1),max(vt1))
fprintf('雨滴體積最小值:%g \n雨滴體積最大值:%g \n',min(v),max(v))
%(B)再將此雨滴粒半徑依序由小到大排列
b=sort(a)
%(C)然後再計算各粒徑的雨滴的終端速度(VT)
vt2=(9.8*(b*10^-6).^2*(997-1.204))/18/(1.81*10^-5);

%(D)然後以 plot 指令,繪出水平軸為雨滴半徑
%垂直軸為雨滴終端速度的雨滴半徑與終端速度圖(f1)
subplot(2,1,1)
plot(b,vt2)
title('00781035-f1')
xlabel('雨滴半徑(m)')
ylabel('雨滴終端速度(m/s)')
%(E)假設雨滴為球體,以雨滴半徑計算對應體積後
%以 plot 指令,繪出水平軸為雨滴半徑,垂直軸為雨滴體積的雨滴體積與雨滴半徑圖(f2)
%並在排序後的第 80 個雨滴半徑及體積位置,以 text()函數加入紅色”+”文字。
v2=4*pi*((b*10^-6).^3)/3  %體積
subplot(2,1,2)
plot(b,v2)
title('00781035-f2')
xlabel('雨滴半徑(m)')
ylabel('雨滴體積(m^3)')
v80=v2(80)  %排序後的第 80 個雨滴體積
text(b(80),v80,'+','color','r')
%(F) 以上圖形標題請用您的”學號”,再加入適當的 x 軸的文字說明
%和 y 軸的文字說明,最後將圖存為 jpg 格式檔案。
%並將它們排成 2x1 的圖形陣列,其排列格式如:[f1;f2]
saveas(gcf,'00781035_ex05.jpg','jpg')